### Bibliotēka Pandas

Bibliotēka Pandas dot iespēju ielādēt datus no dažādiem datu avotiem - no datnēm (CSV, Excel, HTML, JSON u.c.) un datubāzēm ar vaicājuma palīdzību.
Reālajā dzīvē dati nebūs tīri, nebūs skaitliskā formātā, varēs saturēt kļūdainus un trūkstošas vērtības. Bibliotēkas Pandas nozīmi priekš Python var salīdzināt ar Excel nozīmi priekš MS Windows.

Pandas ir izveidota uz bibliotējas numpy pamata. Tā iekļauj visu numpy funkcionalitāti un paplašina to.

Pamatā dati glabājas divos formātos:

    - Pandas Series
    - Pandas Data Frame

In [1]:
# Bibliotēkas inportēšana un versijas attēlošana
import pandas as pd
pd.__version__

'2.2.2'

#### Izskatīsim formātu 'Series'

Pandas Series ir nekas cits kā dati no vienas kolonnas. Tomēr šai kolonnai būs virsraksts (column name) un ierakstu indekss. Ierakstu indeksam būs nosaukums (index name) un ierakstiem būs pozīcija indeksā (index positions). Indekss var būt viens, bet var arī būt vairāki indeksi vienlaikus.

Izveidosim Pandas Series

In [2]:
# Importēsim Numpy
import numpy as np

In [4]:
# Izveidosim Python list un numpy.array
mylist = [5.4,6.1,1.7,99.8]
myarray = np.array(mylist)

Konvertēsim list un array Pandas series formātā. Konvertācijas notiek, izmantojot funkciju pandas.Series, kas saņem šādus parametrus:

- data = None - dati, kuri ir jākonvertē
- index = None - saraksts ar indeksa vērtībām, ja tādas ir zināmas
- dtype = None - datu tips
- name = None - Series nosaukums (kolonnas nosaukums)
- copy = False - kopēt datus un izveidot jaunu mainīgu (True) vai izveidot atsauci uz datiem (False)

In [5]:
# Konvertēsim abus Python Series formātā
series1 = pd.Series(data=mylist)
print(series1)
series2 = pd.Series(data=myarray)
print(series2)

0     5.4
1     6.1
2     1.7
3    99.8
dtype: float64
0     5.4
1     6.1
2     1.7
3    99.8
dtype: float64

In [6]:
# Pievienosim nosaukumu
series1 = pd.Series(data=mylist,name="Parauga Series")
print(series1)

0     5.4
1     6.1
2     1.7
3    99.8
Name: Parauga Series, dtype: float64

In [7]:
# Piekļūšana elementiem, izmantojot indeksu
print(series1[3])

99.8

In [8]:
# Ir iespējams patstāvīgi definēt indeksu vai arī piešķirt labels rindām

mylabels = ['pirmais','otrais','trešais','ceturtais']
series3 = pd.Series(data=mylist,index=mylabels,name="Series 3")
print(series3)

pirmais       5.4
otrais        6.1
trešais       1.7
ceturtais    99.8
Name: Series 3, dtype: float64

In [9]:
series4 = pd.Series(mylist,mylabels)
print(series4)

pirmais       5.4
otrais        6.1
trešais       1.7
ceturtais    99.8
dtype: float64

In [10]:
# Un tagad ir iespējams piekļūt ierakstam pēc rindas nosaukuma (label)
print(series4['ceturtais'])

99.8

In [12]:
# Un joprojām var piekļūt elementam arī pēc indeksa
print(series4.iloc[2])

1.7

In [17]:
# Ar Series var izpildīt matemātiskās operācijas
series5 = pd.Series([5.5,1.1,8.8,1.6],['pirmais','trešais','ceturtais','piektais'])
print(series5)

pirmais      5.5
trešais      1.1
ceturtais    8.8
piektais     1.6
dtype: float64

In [19]:
series4

pirmais       5.4
otrais        6.1
trešais       1.7
ceturtais    99.8
dtype: float64

In [20]:
series4+series5

ceturtais    108.6
otrais         NaN
piektais       NaN
pirmais       10.9
trešais        2.8
dtype: float64

Rezultāts NaN (not a number) tika iegūts, jo indeksa label 'otrais' eksistē tikai series4, bet indeksa label 'piektais' - tikai series5. Līdz ar to vērtībām ar šiem diviem indeksiem matemātiskā operācija netika izpildīta un tika atgriezts NaN. Veicot matemātiskās operācijas ar Pandas Series ir jāpārliecinās, ka indeksi sakrīt, jo tiek skatīts nevis pēc rindām, bet pēc indeksa. Un pat ja viena Series ir sakārtota, bet otrā nav sakārtota, matēmātiskā operācija tā pat notiks korekti, jo vertības, kurām ir jāveic matemātiskā operācija, tiks meklētas nevis pēc rindas numura, bet pēc indeksa vērtības.

### Parunāsim par formātu 'DataFrame'
- Satur vairāk pār 1 Series
- Rindu un kolonnu struktūra ir līdzīga Excel rindu un kolonnu truktūrai

In [22]:
# Ir iespējams kombinēt Series, lai iegūtu DataFrame
# axis=1 - tiek apvienotas kā kolonnas
# axis=0 - tiek apvienotas kā rindas
df_1 = pd.concat([series4,series5],axis=1,sort=False)
df_1

              0    1
pirmais     5.4  5.5
otrais      6.1  NaN
trešais     1.7  1.1
ceturtais  99.8  8.8
piektais    NaN  1.6

In [31]:
# Var arī izveidot pilnīgi jaunu DataFrame
df_2 = pd.DataFrame(data = np.random.randint(-10,25,(5,5)))
df_2

    0   1   2   3   4
0  24  11  17  -9   0
1   4  24   1   5  22
2 -10  17  16  -4  -9
3   8  12   0   8   8
4  20   5  20  20  -6

Izveidotajā DataFrame ir noklusējuma indekss un nav kolonnu nosaukumu. Izveidosim DataFrame ar kolonnu nosaukumiem un predefinēto indeksu.

In [32]:
df_3 = pd.DataFrame(np.random.randint(-10,25,(5,5)),
                    index=['rinda1','rinda2','rinda3','rinda4','rinda5'],
                   columns=['col1','col2','col3','col4','col5'])
df_3

        col1  col2  col3  col4  col5
rinda1     8     6     5   -10    21
rinda2    14    19    20    18    22
rinda3     2    -3    -6    23    13
rinda4     7    -4    10    24    -9
rinda5    19    23    -7    -8    -9

In [33]:
print(df_3['col2'])

rinda1     6
rinda2    19
rinda3    -3
rinda4    -4
rinda5    23
Name: col2, dtype: int64

In [34]:
# Ir iespejams piekļūt individuāliem Series
print(df_3['col2']) # Katra kolonna ir Series
print('\n')
df_3[['col3','col1']]

rinda1     6
rinda2    19
rinda3    -3
rinda4    -4
rinda5    23
Name: col2, dtype: int64

        col3  col1
rinda1     5     8
rinda2    20    14
rinda3    -6     2
rinda4    10     7
rinda5    -7    19

#### Indeksācijas un meklēšanas atribūti loc un iloc

In [35]:
df_3

        col1  col2  col3  col4  col5
rinda1     8     6     5   -10    21
rinda2    14    19    20    18    22
rinda3     2    -3    -6    23    13
rinda4     7    -4    10    24    -9
rinda5    19    23    -7    -8    -9

In [39]:
# Var piekļūt DataFrame rindām
# Izmantojot indeksa label (row name)
df_3.loc['rinda4']

col1     7
col2    -4
col3    10
col4    24
col5    -9
Name: rinda4, dtype: int64

In [40]:
df_3.loc["rinda5"]

col1    19
col2    23
col3    -7
col4    -8
col5    -9
Name: rinda5, dtype: int64

In [42]:
# Izmantojot rindas skaitlisko indeksu
df_3.iloc[2]

col1     2
col2    -3
col3    -6
col4    23
col5    13
Name: rinda3, dtype: int64

In [43]:
df_3.loc[['rinda4','rinda1'],['col2','col3']]

        col2  col3
rinda4    -4    10
rinda1     6     5

In [44]:
df_3.loc["rinda1","col3"]

5

In [45]:
df_3.iloc[1,2]

20

---

#### Atlase ar nosacījumu, jeb Boolean Masking

In [47]:
df_3

        col1  col2  col3  col4  col5
rinda1     8     6     5   -10    21
rinda2    14    19    20    18    22
rinda3     2    -3    -6    23    13
rinda4     7    -4    10    24    -9
rinda5    19    23    -7    -8    -9

In [48]:
# we can use logical indexing for dataframes just like for numpy arrays
df_3>0

        col1   col2   col3   col4   col5
rinda1  True   True   True  False   True
rinda2  True   True   True   True   True
rinda3  True  False  False   True   True
rinda4  True  False   True   True  False
rinda5  True   True  False  False  False

In [49]:
df_3[df_3>0]

        col1  col2  col3  col4  col5
rinda1     8   6.0   5.0   NaN  21.0
rinda2    14  19.0  20.0  18.0  22.0
rinda3     2   NaN   NaN  23.0  13.0
rinda4     7   NaN  10.0  24.0   NaN
rinda5    19  23.0   NaN   NaN   NaN

#### Darbības ar kolonnām

In [50]:
# Pievienosim jaunu kolonnu
df_3['col6'] = np.random.randint(-100,100,(5,1))
df_3

        col1  col2  col3  col4  col5  col6
rinda1     8     6     5   -10    21     1
rinda2    14    19    20    18    22   -61
rinda3     2    -3    -6    23    13    40
rinda4     7    -4    10    24    -9   -51
rinda5    19    23    -7    -8    -9    69

In [52]:
# Izņemsim kolonnu no DataFrame
df_3.drop('col1',axis=1)

        col2  col3  col4  col5  col6
rinda1     6     5   -10    21     1
rinda2    19    20    18    22   -61
rinda3    -3    -6    23    13    40
rinda4    -4    10    24    -9   -51
rinda5    23    -7    -8    -9    69

In [53]:
df_3

        col1  col2  col3  col4  col5  col6
rinda1     8     6     5   -10    21     1
rinda2    14    19    20    18    22   -61
rinda3     2    -3    -6    23    13    40
rinda4     7    -4    10    24    -9   -51
rinda5    19    23    -7    -8    -9    69

In [56]:
#Izņemsim kolonnu bez jauna DF izveidošanas (inplace=True)
df_10 = df_3.copy()
df_10

        col1  col2  col3  col4  col5  col6
rinda1     8     6     5   -10    21     1
rinda2    14    19    20    18    22   -61
rinda3     2    -3    -6    23    13    40
rinda4     7    -4    10    24    -9   -51
rinda5    19    23    -7    -8    -9    69

In [57]:
df_10.drop("col1",axis= 1,inplace = True)

In [58]:
df_10

        col2  col3  col4  col5  col6
rinda1     6     5   -10    21     1
rinda2    19    20    18    22   -61
rinda3    -3    -6    23    13    40
rinda4    -4    10    24    -9   -51
rinda5    23    -7    -8    -9    69

In [59]:
df_3

        col1  col2  col3  col4  col5  col6
rinda1     8     6     5   -10    21     1
rinda2    14    19    20    18    22   -61
rinda3     2    -3    -6    23    13    40
rinda4     7    -4    10    24    -9   -51
rinda5    19    23    -7    -8    -9    69

In [60]:
# Ar jauna DF izveidošanu
df_4 = df_3.drop('col1',axis=1)
df_4

        col2  col3  col4  col5  col6
rinda1     6     5   -10    21     1
rinda2    19    20    18    22   -61
rinda3    -3    -6    23    13    40
rinda4    -4    10    24    -9   -51
rinda5    23    -7    -8    -9    69

#### Darbības ar rindām

In [62]:
# Nodzēsisim vienu rindu
df_5 = df_3.drop('rinda2',axis=0)
df_5

        col1  col2  col3  col4  col5  col6
rinda1     8     6     5   -10    21     1
rinda3     2    -3    -6    23    13    40
rinda4     7    -4    10    24    -9   -51
rinda5    19    23    -7    -8    -9    69

In [63]:
# DF var nomest rindu indeksu
df_5.reset_index()

    index  col1  col2  col3  col4  col5  col6
0  rinda1     8     6     5   -10    21     1
1  rinda3     2    -3    -6    23    13    40
2  rinda4     7    -4    10    24    -9   -51
3  rinda5    19    23    -7    -8    -9    69

In [64]:
df_5

        col1  col2  col3  col4  col5  col6
rinda1     8     6     5   -10    21     1
rinda3     2    -3    -6    23    13    40
rinda4     7    -4    10    24    -9   -51
rinda5    19    23    -7    -8    -9    69

In [65]:
df_5.reset_index(inplace=True)
df_5

    index  col1  col2  col3  col4  col5  col6
0  rinda1     8     6     5   -10    21     1
1  rinda3     2    -3    -6    23    13    40
2  rinda4     7    -4    10    24    -9   -51
3  rinda5    19    23    -7    -8    -9    69

Var redzēt, ka indekss tika nomests uz noklusējuma indeksu un rindas nosaukumi kļuvuši par jauno kolonnu "index".

Lai nomest indeksu tā, ka vecais indekss nesaglabātos jaunaja kolonnā, ir jānorāda papildus parametrs: drop=True

In [66]:
df_5 = df_3.drop('rinda2',axis=0)
df_5

        col1  col2  col3  col4  col5  col6
rinda1     8     6     5   -10    21     1
rinda3     2    -3    -6    23    13    40
rinda4     7    -4    10    24    -9   -51
rinda5    19    23    -7    -8    -9    69

In [67]:
df_5.reset_index(inplace=True, drop=True)
df_5

   col1  col2  col3  col4  col5  col6
0     8     6     5   -10    21     1
1     2    -3    -6    23    13    40
2     7    -4    10    24    -9   -51
3    19    23    -7    -8    -9    69

In [68]:
# Ir iespējams piešķirt jaunus nosaukumus rindām
df_5['new_name'] = ['This','is','the','row']
df_5

   col1  col2  col3  col4  col5  col6 new_name
0     8     6     5   -10    21     1     This
1     2    -3    -6    23    13    40       is
2     7    -4    10    24    -9   -51      the
3    19    23    -7    -8    -9    69      row

In [69]:
# Pārveidojam kolonnu par indeksu
df_5.set_index('new_name',inplace=True)
df_5

          col1  col2  col3  col4  col5  col6
new_name
This         8     6     5   -10    21     1
is           2    -3    -6    23    13    40
the          7    -4    10    24    -9   -51
row         19    23    -7    -8    -9    69

# DataFrame kombinēšana

Veidi, kuros pandas DataFrame var būt kombinēti ir līdzīgi SQL

Izskatīsim 3 veidus

1. concat
2. join
3. merge

In [71]:
# Izveidosim DataFrame
df_7 = pd.DataFrame({"customer":['1001','1002','1003','1004'], 
                    'category': ['cat3','cat1','cat1','cat2'],
                    'important': ['yes','no','yes','yes'],
                    'sales': [123,52,214,663]},index=[0,1,2,3])

df_8 = pd.DataFrame({"customer":['1001','1003','1004','1005'], 
                    'color': ['yellow','green','green','blue'],
                    'distance': [22,19,24,28],
                    'sales': [123,214,663,331]},index=[4,5,6,7])

In [72]:
df_7

  customer category important  sales
0     1001     cat3       yes    123
1     1002     cat1        no     52
2     1003     cat1       yes    214
3     1004     cat2       yes    663

In [73]:
df_8

  customer   color  distance  sales
4     1001  yellow        22    123
5     1003   green        19    214
6     1004   green        24    663
7     1005    blue        28    331

In [74]:
# Apvienosim DF, saliekot rindas un nesakārtojot rindas pēc apvienošanas
pd.concat([df_7,df_8],axis=0,sort=False)

  customer category important  sales   color  distance
0     1001     cat3       yes    123     NaN       NaN
1     1002     cat1        no     52     NaN       NaN
2     1003     cat1       yes    214     NaN       NaN
3     1004     cat2       yes    663     NaN       NaN
4     1001      NaN       NaN    123  yellow      22.0
5     1003      NaN       NaN    214   green      19.0
6     1004      NaN       NaN    663   green      24.0
7     1005      NaN       NaN    331    blue      28.0

In [75]:
# Pieliksim sakārtošanu
pd.concat([df_7,df_8],axis=0,sort=True)

  category   color customer  distance important  sales
0     cat3     NaN     1001       NaN       yes    123
1     cat1     NaN     1002       NaN        no     52
2     cat1     NaN     1003       NaN       yes    214
3     cat2     NaN     1004       NaN       yes    663
4      NaN  yellow     1001      22.0       NaN    123
5      NaN   green     1003      19.0       NaN    214
6      NaN   green     1004      24.0       NaN    663
7      NaN    blue     1005      28.0       NaN    331

In [76]:
# Apvienosim saliekot kolonnas
pd.concat([df_7,df_8],axis=1,sort=False)

  customer category important  sales customer   color  distance  sales
0     1001     cat3       yes  123.0      NaN     NaN       NaN    NaN
1     1002     cat1        no   52.0      NaN     NaN       NaN    NaN
2     1003     cat1       yes  214.0      NaN     NaN       NaN    NaN
3     1004     cat2       yes  663.0      NaN     NaN       NaN    NaN
4      NaN      NaN       NaN    NaN     1001  yellow      22.0  123.0
5      NaN      NaN       NaN    NaN     1003   green      19.0  214.0
6      NaN      NaN       NaN    NaN     1004   green      24.0  663.0
7      NaN      NaN       NaN    NaN     1005    blue      28.0  331.0

# Merge un Join

Merge kombinē dataframes izmantojot kolonnas vērtības līdzīgo ierakstu identificēšanai

Join kombinē dataframes izmantojot indeksu līdzīgo ierakstu identificēšanai

In [77]:
pd.merge(df_7,df_8,how='outer',on='customer') # outer merge ir union pēc norādītās kolonnas

  customer category important  sales_x   color  distance  sales_y
0     1001     cat3       yes    123.0  yellow      22.0    123.0
1     1002     cat1        no     52.0     NaN       NaN      NaN
2     1003     cat1       yes    214.0   green      19.0    214.0
3     1004     cat2       yes    663.0   green      24.0    663.0
4     1005      NaN       NaN      NaN    blue      28.0    331.0

In [78]:
pd.merge(df_7,df_8,how='inner',on='customer') # inner merge ir intersection pēc norādītās kolonnas

  customer category important  sales_x   color  distance  sales_y
0     1001     cat3       yes      123  yellow        22      123
1     1003     cat1       yes      214   green        19      214
2     1004     cat2       yes      663   green        24      663

In [79]:
pd.merge(df_7,df_8,how='right',on='customer') # right merge ir SQL right join

  customer category important  sales_x   color  distance  sales_y
0     1001     cat3       yes    123.0  yellow        22      123
1     1003     cat1       yes    214.0   green        19      214
2     1004     cat2       yes    663.0   green        24      663
3     1005      NaN       NaN      NaN    blue        28      331

In [80]:
pd.merge(df_7,df_8,how='left',on='customer') # left merge ir SQL left join

  customer category important  sales_x   color  distance  sales_y
0     1001     cat3       yes      123  yellow      22.0    123.0
1     1002     cat1        no       52     NaN       NaN      NaN
2     1003     cat1       yes      214   green      19.0    214.0
3     1004     cat2       yes      663   green      24.0    663.0

In [81]:
# Izveidosim vēl 2 DF
df_9 = pd.DataFrame({'A1': [201,202,203],
                    'A2': [301,302,303]},
                   index=['I0','I1','I2'])

df_10 = pd.DataFrame({'A3': [401,402,403],
                    'A4': [501,502,503]},
                   index=['I0','I2','I3'])

In [82]:
# join izpildās līdzīgi merge, 
# vienīgi tas izmanto nevis kolonnas vērtības, bet indeksa vērtības
df_9.join(df_10,how='outer')

       A1     A2     A3     A4
I0  201.0  301.0  401.0  501.0
I1  202.0  302.0    NaN    NaN
I2  203.0  303.0  402.0  502.0
I3    NaN    NaN  403.0  503.0

In [83]:
df_9.join(df_10,how='inner')

     A1   A2   A3   A4
I0  201  301  401  501
I2  203  303  402  502

---

#### Citas funkcijas

In [84]:
df_8

  customer   color  distance  sales
4     1001  yellow        22    123
5     1003   green        19    214
6     1004   green        24    663
7     1005    blue        28    331

In [85]:
# Informācija par DF
df_8.info()

<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, 4 to 7
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   customer  4 non-null      object
 1   color     4 non-null      object
 2   distance  4 non-null      int64
 3   sales     4 non-null      int64
dtypes: int64(2), object(2)
memory usage: 332.0+ bytes

Izskatīsim daas vienkāršas funkcijas dataframe'iem

In [86]:
# Unikālās vērtības kolonnā
df_8['color'].unique()

array(['yellow', 'green', 'blue'], dtype=object)

In [87]:
df_8.color

4    yellow
5     green
6     green
7      blue
Name: color, dtype: object

In [88]:
df_8

  customer   color  distance  sales
4     1001  yellow        22    123
5     1003   green        19    214
6     1004   green        24    663
7     1005    blue        28    331

In [89]:
# Ierakstu skaits ar katru unikālo vērtību
df_8['color'].value_counts()

color
green     2
yellow    1
blue      1
Name: count, dtype: int64

In [90]:
# Vidējais aritmetiskais kolonnai
df_8["sales"].mean()

332.75

In [91]:
df_9

     A1   A2
I0  201  301
I1  202  302
I2  203  303

In [92]:
# Vidējais aritmetiskais katrai kolonnai
df_9.mean()

A1    202.0
A2    302.0
dtype: float64

In [95]:
df_8

  customer   color  distance  sales
4     1001  yellow        22    123
5     1003   green        19    214
6     1004   green        24    663
7     1005    blue        28    331

In [96]:
df_8.mean()

TypeError: Could not convert ['1001100310041005' 'yellowgreengreenblue'] to numeric

In [97]:
df_8.columns

Index(['customer', 'color', 'distance', 'sales'], dtype='object')

In [98]:
df_8

  customer   color  distance  sales
4     1001  yellow        22    123
5     1003   green        19    214
6     1004   green        24    663
7     1005    blue        28    331

In [99]:
new_df = df_8[(df_8['customer']!='1005') & (df_8['color']!='blue')] 
new_df

  customer   color  distance  sales
4     1001  yellow        22    123
5     1003   green        19    214
6     1004   green        24    663

In [100]:
(df_8['customer']!='1005')

4     True
5     True
6     True
7    False
Name: customer, dtype: bool

In [101]:
(df_8['color']!='blue')

4     True
5     True
6     True
7    False
Name: color, dtype: bool

In [102]:
(df_8['customer']!='1005') & (df_8['color']!='blue')

4     True
5     True
6     True
7    False
dtype: bool

In [103]:
new_df = df_8[(df_8['customer']!='1005') & (df_8['color']!='green')] 
new_df

  customer   color  distance  sales
4     1001  yellow        22    123

In [104]:
print(df_8['sales'].sum())
print(df_8['distance'].min())

1331
19

In [105]:
print(df_8['distance'].max())

28

In [106]:
def multiply(s):
    return s*2 # 2 times

In [107]:
df_8

  customer   color  distance  sales
4     1001  yellow        22    123
5     1003   green        19    214
6     1004   green        24    663
7     1005    blue        28    331

In [108]:
df_8['sales'].apply(multiply)

4     246
5     428
6    1326
7     662
Name: sales, dtype: int64

In [109]:
df_8

  customer   color  distance  sales
4     1001  yellow        22    123
5     1003   green        19    214
6     1004   green        24    663
7     1005    blue        28    331

In [110]:
df_8["new sales"] = df_8['sales'].apply(multiply)
df_8

  customer   color  distance  sales  new sales
4     1001  yellow        22    123        246
5     1003   green        19    214        428
6     1004   green        24    663       1326
7     1005    blue        28    331        662

In [112]:
df_11 = df_8[['distance','sales']]
df_11.map(multiply)

   distance  sales
4        44    246
5        38    428
6        48   1326
7        56    662

In [113]:
df_11

   distance  sales
4        22    123
5        19    214
6        24    663
7        28    331

In [114]:
df_8

  customer   color  distance  sales  new sales
4     1001  yellow        22    123        246
5     1003   green        19    214        428
6     1004   green        24    663       1326
7     1005    blue        28    331        662

In [115]:
del df_8['color']
df_8

  customer  distance  sales  new sales
4     1001        22    123        246
5     1003        19    214        428
6     1004        24    663       1326
7     1005        28    331        662

In [116]:
df_8.sort_values(by='distance',inplace=True)
df_8

  customer  distance  sales  new sales
5     1003        19    214        428
4     1001        22    123        246
6     1004        24    663       1326
7     1005        28    331        662

In [117]:
df_8.sort_values(by='distance',inplace=True,ascending=False)
df_8

  customer  distance  sales  new sales
7     1005        28    331        662
6     1004        24    663       1326
4     1001        22    123        246
5     1003        19    214        428

In [ ]:
df_8

In [120]:
# Ja dažas Series satur vairākus ierakstus ar vienādām vērtībām, ir iespējams grupēt ierakstus 
mydict = {'customer': ['Customer1','Customer1','Customer2','Customer2','Customer3','Customer3'], 
          'product1': [1.1,2.1,3.8,4.2,5.5,6.9],
          'product2': [8.2,9.1,11.1,5.2,44.66,983]}
df_6 = pd.DataFrame(mydict,index=['Purchase 1','Purchase 2','Purchase 3','Purchase 4','Purchase 5','Purchase 6'])
df_6

             customer  product1  product2
Purchase 1  Customer1       1.1      8.20
Purchase 2  Customer1       2.1      9.10
Purchase 3  Customer2       3.8     11.10
Purchase 4  Customer2       4.2      5.20
Purchase 5  Customer3       5.5     44.66
Purchase 6  Customer3       6.9    983.00

In [121]:
df_6["customer"].value_counts()

customer
Customer1    2
Customer2    2
Customer3    2
Name: count, dtype: int64

In [122]:
grouped_data = df_6.groupby('customer')
print(grouped_data)

<pandas.core.groupby.generic.DataFrameGroupBy object at 0x168b97fd0>

In [123]:
grouped_data.std()

           product1    product2
customer
Customer1  0.707107    0.636396
Customer2  0.282843    4.171930
Customer3  0.989949  663.506577

In [124]:
df_6

             customer  product1  product2
Purchase 1  Customer1       1.1      8.20
Purchase 2  Customer1       2.1      9.10
Purchase 3  Customer2       3.8     11.10
Purchase 4  Customer2       4.2      5.20
Purchase 5  Customer3       5.5     44.66
Purchase 6  Customer3       6.9    983.00

In [125]:
df_6.groupby('customer').mean()

           product1  product2
customer
Customer1       1.6      8.65
Customer2       4.0      8.15
Customer3       6.2    513.83

In [126]:
df_6.groupby('customer').sum()

           product1  product2
customer
Customer1       3.2     17.30
Customer2       8.0     16.30
Customer3      12.4   1027.66

In [127]:
df_8

  customer  distance  sales  new sales
7     1005        28    331        662
6     1004        24    663       1326
4     1001        22    123        246
5     1003        19    214        428

#### DataFrame saglabāšana datnē un nolasīšana

In [128]:
df_8.to_csv('df_8.csv',index=True)

In [129]:
new_df_8 = pd.read_csv('df_8.csv')
new_df_8

   Unnamed: 0  customer  distance  sales  new sales
0           7      1005        28    331        662
1           6      1004        24    663       1326
2           4      1001        22    123        246
3           5      1003        19    214        428

In [130]:
new_df_8 = pd.read_csv('df_8.csv',index_col=0)
new_df_8

   customer  distance  sales  new sales
7      1005        28    331        662
6      1004        24    663       1326
4      1001        22    123        246
5      1003        19    214        428

#### Saglabāšanas Excel formātā

Nepieciešams uzinstalēt moduli openpyxl

In [132]:
df_8.to_excel('df_8.xlsx',index=False,sheet_name='first sheet')
newer_df_8 = pd.read_excel('df_8.xlsx',sheet_name='first sheet',index_col=1)
newer_df_8

          customer  sales  new sales
distance
28            1005    331        662
24            1004    663       1326
22            1001    123        246
19            1003    214        428